
"Battery Power" = "Akku";
"AC Power" = "Virtalähde";
"UPS Power" = "UPS";

//Alternate Power Adapter tabViewItem label
"Power" = "Virta";

//The power warning sheet
"Restore Defaults" = "Palauta oletusarvot";
"OK" = "OK";
"Cancel" = "Kumoa";

"UPS Power Checkbox" = "Näytä UPS-tila valikkorivillä";
//"Battery Power Checkbox"= "Show battery status in the menu bar";

// the UPS status
"percent full" = "%.0f %% täynnä";
"Current UPS Charge" = "Nykyinen varaus: %.0f %%";

"Power consumption may be greater than normal." = "Tietokone saattaa kuluttaa enemmän energiaa näillä asetuksilla.";
"Reset by clicking Restore Defaults" = "Osoittamalla Palauta oletusarvot kulutat vähemmän energiaa.";

"Network wake noise warning" = "Kun ”Herää verkkoyhteydestä” on käytössä, saatat toisinaan kuulla tietokoneen heräävän.";
"Wakes for detection" = "Tämä ilmoittaa muille laitteille, että tietokone on edelleen käytettävissä verkossa.";

"Wake for network" = "Herää verkkoyhteydestä";
"Wake for Ethernet" = "Herää ethernet-verkkoyhteydestä";
"Wake for AirPort" = "Herää AirPort-verkkoyhteydestä";

"Custom" = "Muokattu";

"Schedule Warning- power adapter must be present" = "Ajastettu käynnistys tapahtuu vain, kun virtalähde on liitettynä Maciin.";

// the Battery Status is always appended to one of the above strings so a space is provided at the strings beginning.
"Battery Status" = "Nykyinen akun lataus: %.0f %%. Aikaa jäljellä noin: %@";
"Battery Status, Charged" = "Akku on ladattu.";
"Short Battery Status" = "Aikaa jäljellä arviolta: %@ (%.0f %%)";
"Battery Status, Charging" = "Nykyinen akun lataus: %.0f %% Aikaa jäljellä kunnes täynnä: %@";
"Short Battery Status, Charging" = "Aikaa kunnes täysi arviolta: %@ (%.0f %%)";
"Current Charge" = "Nykyinen akun lataus: %.0f%%";
"Calculating time" = "Lasken aikaa";
 
"Check Battery" = "Huollata akku."; 
"Poor Battery" = "Akun kunto: vaihda nyt.";
"Fair Battery" = "Akun kunto: vaihda pian.";


"AutoProc" = "Automaattinen";
"HighProc" = "Korkein";
"NormalProc" = "Alennettu";

/* strings for tool tips */
"minute" = "minuutti";
"minutes" = "minuuttia";
"hour" = "tunti";
"hours" = "tuntia";

"dim" = "Himmennä";
"sleep" = "Nukkuminen";
"halfminute" = ".5";

/* Format String to display tool tip with.  MUST contain two arguments that show where to insert the display
    dim time %1$@  and where to insert the display sleep time %2$@    They can be in any order.  The %1
    tells the string to put the first (dim time) parameter in that location.  %2 indicates the place to put
    the display sleep time. */
"Dim %@. Sleep %@." = "Himmennä %1$@. Laita nukkumaan %2$@.";

"Never" = "Ei koskaan";
"1 minute" = "1 minuutti";
"3 minutes" = "3 minuuttia";
"5 minutes" = "5 minuuttia";
"10 minutes" = "10 minuuttia";
"15 minutes" = "15 minuuttia";
"20 minutes" = "20 minuuttia";
"25 minutes" = "25 minuuttia";
"30 minutes" = "30 minuuttia";  
"45 minutes" = "45 minuuttia";
"1 hour" = "1 tunti";
"1 hour 15 minutes" = "1 tunti 15 minuuttia";
"1 hour 30 minutes" = "1 tunti 30 minuuttia";  
"1 hour 45 minutes" = "1 tunti 45 minuuttia";
"2 hours" = "2 tuntia";
"3 hours" = "3 tuntia";

"Better Energy Savings" = "Suurempi energiansäästö";
"Better Battery Life" = "Pidempi akun käyttöaika";
"Better UPS Life" = "Parempi UPS:n kesto";

// *** Note to localizers: These strings will be clipped if they get much longer.
// The second string is almost as long as possible (about two additional character widths are possible)
"GFX_CHANGE_WARNING_TEXT_LOGOUT" = "Kirjaudu ulos, jotta muutos tulee voimaan";
"GFX_CHANGE_WARNING_TEXT_ALL_LOGOUT" = "Kaikkien tulee kirjautua ulos, jotta muutos tulee voimaan";
"GFX_CHANGE_WARNING_TEXT_RESTART" = "Tietokone on käynnistettävä uudelleen, jotta muutos tulee voimaan";

"GFX_CHANGE_TITLE" = "Grafiikka-asetusten muuttaminen vaatii uloskirjautumisen.";
"GFX_CHANGE_DESC" = "Jatka osoittamalla Kirjaudu ulos. Sinulla on mahdollisuus tallentaa kaikki avoimet dokumentit.";
"GFX_CHANGE_TITLE2" = "Grafiikka-asetusten muuttaminen vaatii uudelleenkäynnistyksen.";
"GFX_CHANGE_DESC2" = "Jatka osoittamalla Käynnistä uudelleen. Sinulla on mahdollisuus tallentaa kaikki avoimet dokumentit.";
"LOGOUT_BUTTON" = "Kirjaudu ulos";
"RESTART_BUTTON" = "Käynnistä uudelleen";

"AUTO_SWITCH_MSG_ON"  = "Tietokone vaihtaa näytönohjaimen tilaa automaattisesti akun pisimmän käyttöajan saavuttamiseksi.";
"AUTO_SWITCH_MSG_OFF" = "Kun automaattinen vaihto ei ole käytössä, käyttää tietokone aina suuritehoista näytönohjainta.\nTämä saattaa lyhentää akun käyttöaikaa.";

//"Custom Profile Tooltip" = "Custom Settings";

//"energy savings" = "energy savings";
//"battery life" = "battery life";
//"UPS life" = "UPS life";

//"Profile High Perf Rating" = "Your energy settings are optimized for high performance.";
//"Profile Better Performance Rating" = "Your energy settings are optimized for better than average %@.";
//"Profile Normal Rating" = "Your energy settings are optimized for normal performance and %@.";
//"Profile Better Energy Rating" = "Your energy settings are optimized for better than average %@.";

//"long battery life" = "long battery life";
//"long UPS life" = "long UPS life";
//"high energy savings" = "high energy savings";
//"Profile High Energy Savings Rating" = "Your energy settings are optimized for %@.";


